# Задание 2.
# Разработайте приложение „I love drink“, со следующим
# функционалом:
# 1) Учет напитков:
# 1.1) Хранение данных об алкогольных напитках и ингредиентах
# 1.2) Учет остатков на складе
# 2) Управление коктейлями:
# 2.1) Хранение данных о коктейлях(название,
# крепость(автоматический расчет исходя из крепости алкогольных
# напитков), состав, цена)
# 3) Операции
# 3.1) Продажа коктейлей и алкогольных напитков
# 3.2) Пополнение запасов
# В приложении должна использоваться база данных для хранения
# информации.